package homeWork;

public class hw3 {
    public static void main(String[] args) {
        /*
         * Напишите класс Calculator, 
         * который будет выполнять математические операции (+, -, *, /) над двумя числами и возвращать результат. 
         * В классе должен быть метод calculate, который принимает оператор и значения аргументов и возвращает результат вычислений.
         * При неверно переданном операторе, программа должна вывести сообщение об ошибке "Некорректный оператор: 'оператор'".
         */

         

    }
}
