package homeWork;

import javax.sound.midi.SysexMessage;

public class hw5 {
    public static void main(String[] args) {
        // Реализовать функцию возведения числа а в степень b. a, b из Z. Сводя количество выполняемых действий к минимуму.
        int a = 3;
        int b = 2;
        System.out.println(Math.pow(a, b));
    }
    
    
}
